(function () {
  'use strict';

  angular
      .module('distanceLearning.faculty')
      .factory('FacultyUtils', FacultyUtils);

  FacultyUtils.$inject = [];

  function FacultyUtils() {
    var base = [
      {
        name: 'Математичний факультет  ',
        description: 'Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях.При создании генератора мы использовали небезызвестный универсальный код речей. ',
        image: '',
        objects: [
          {name: 'Основи економіки'},
          {name: 'Основи економіки та підприємства'},
          {name: 'Основи економіки'},
          {name: 'Основи економіки'},
          {name: 'Основи економіки'}
        ]
      },
      {
        name: 'Навчально-науковий інститут економіки і права ',
        description: 'Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сген',
        image: '',
        objects: [
          {name: 'Основи економіки'},
          {name: 'Основи економіки'},
          {name: 'Основи економіки'},
          {name: 'Основи економіки'},
          {name: 'Основи економіки'}
        ]
      },
      {
        name: 'Навчально-науковий інститут іноземних мов',
        description: 'Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сген',
        image: '',
        objects: [
          {name: 'Основи економіки'},
          {name: 'Судовая медицина и психиатрия'},
          {name: 'Комп‘ютерний еколого-економічний моніторинг.'},
          {name: 'Інформаційні управляючі системи та технології.'},
          {name: 'Англійська мова та література.'}
        ]
      }
    ];

    var service = {
      getRandomPreviewFaculties: getRandomPreviewFaculties
    };

    function getRandomPreviewFaculties () {
      return base;
    }

    return service;
  }
})();
